app/views/entries/show.html.erb


<% @entry.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  ORDER BY "comments"."created_at" DESC  [["entry_id", 300]]